export const beanSalesRules = {
  nutty: {
    label: "너티",
    keywords: ["원두: 너티브라운", "원두: 너티 브라운"],
  },
  fruity: {
    label: "프루티",
    keywords: ["원두: 프루티선라이트", "원두: 프루티 선라이트"],
  },
  decaf: {
    label: "디카페인",
    keywords: ["원두: 디카페인"],
  },
  dripbag: {
    label: "드립백",
    keywords: ["드립백"],
    excludeKeywords: ["드립백 파우치"],
  },
};

export const drinkMenus = [
  "아메리카노",
  "라떼",
  "바닐라 라떼",
  "카푸치노",
  "코르타도",
  "에스프레소",
  "콘파냐",
  "아포가토",
  "카페모카",
  "오늘의 커피",
  "시나몬라떼",
  "남산",
  "안국",
  "그랑핸드",
  "너티 크림라떼",
  "크림라떼",
  "콜드브루",
  "바닐라 콜드브루 라떼",
  "시청",
  "리저브 콜드브루",
  "딸기 말차 라떼",
  "딸기 라떼",
  "우지 말차 라떼",
  "레몬진저 에이드",
  "레몬 진저 티",
  "트로피컬 망고스무디",
  "차이라떼",
  "쇼콜라 밀크",
  "미숫가루 라떼",
  "마살라 차이",
  "밀크티",
  "생망고 주스",
  "스트로베리 블랙티",
  "애플 시나몬",
  "얼그레이",
  "우유",
  "잉글리쉬 브렉퍼스트",
  "캐모마일 티",
  "피치블랙티",
  "피치 파라다이스",
  "히비스커스",
  "자몽민트에이드",
  "바질 토마토 에이드",
  "페퍼민트",
  "의식의 흐름",
  "과테말라 게이샤",
  "에티오피아 내추럴",
  "과테말라 핀카 워시드",
  "브라질 로즈다이아",
  "케냐 야라 AB TOP",
  "에티오피아 시다모 벤사 봄베 바샤 베켈레 무산소 발효 내추럴",
  "페루 카마르카 셀렉토 앤 모리토 게이샤",
  "코스타리카 라 에스메랄다 게이샤 콜드퍼먼테이션 내추럴",
  "콜롬비아 몬테 블랑코 블루베리",
  "콜롬비아 엘 디비소 옴블리곤 내추럴",
  "콜롬비아 마사틀란 에르난도 아실라 카투라 - 블랙베리",
  "콜롬비아 아나야 레드버번 체리 코디얼",
  "콜롬비아 파라이소",
  "봄 블렌드",
  "아이리시 커피",
  "에스프레소 마티니",
];

export const newDrinkMenus = [
  "자몽민트에이드",
  "바질 토마토 에이드",
  "생망고 주스",
  "트로피컬 망고스무디",
  "리저브 콜드브루",
  "우지 말차 라떼",
];

export const singleOriginMenus = [
  {
    name: "봄 블렌드(2026)",
    keywords: [
      "FB 봄 블렌드(2026)",
      "시즈널 블렌딩: 봄 블렌드",
    ],
  },
  {
    name: "과테말라 게이샤",
    keywords: [
      "FB 과테말라 게이샤",
      "과테말라?게이샤?포레스트?옥션",
      "과테말라 라 에르모사 게샤 포레스트 옥션",
    ],
  },
  {
    name: "의식의 흐름",
    keywords: [
      "FB 의식의흐름",
      "FB 의식의 흐름",
      "스페셜 블렌딩: 의식의 흐름",
      "스페셜 블렌드 의식의 흐름",
    ],
  },
  {
    name: "과테말라 핀카 워시드",
    keywords: ["FB 과테말라 핀카 워시드"],
  },
  {
    name: "콜롬비아 파라이소92 피치 바이올렛 (디카페인)",
    keywords: [
      "FB 콜롬비아 파라이소92 피치 바이올렛 (디카페인)",
      "FB 콜롬비아 파라이소92 피치 바이올렛 디카페인",
      "콜롬비아 파라이소 디카페인",
    ],
  },
  {
    name: "예멘 모카 마타리 셀렉션 내추럴",
    keywords: [
      "FB 예맨 모카 마타리 셀렉션 내추럴",
      "FB 예멘 모카 마타리 셀렉션 내추럴",
      "예멘 모카 마타리 셀렉션 내추럴",
    ],
  },
  {
    name: "에티오피아 노르딕 어프로치 구지 시코 내추럴",
    keywords: ["FB 에티오피아 노르딕 어프로치 구지 시코 내추럴"],
  },
  {
    name: "콜롬비아 아나야 옴블리곤 써멀쇼크 워시드 로즈 스플래쉬",
    keywords: ["FB 콜롬비아 아나야 옴블리곤 써멀쇼크 워시드 로즈 스플래쉬"],
  },
  {
    name: "과테말라 핀카 메디나Q APCA",
    keywords: [
      "FB 과테말라 핀카 메디나Q APCA",
      "FB 과테말라 핀카 메디나 Q APCA",
      "과테말라 핀카 메디나Q APCA",
      "과테말라 핀카 메디나 Q APCA",
    ],
  },
  {
    name: "에티오피아 콰미 AFCA Toh Regional 워시드 1위 와테",
    keywords: ["FB 에티오피아 콰미 AFCA Toh Regional 워시드 1위 와테"],
  },
  {
    name: "파나마 아부 게이샤 GW-3155",
    keywords: ["FB 파나마 아부 게이샤 GW-3155"],
  },
  {
    name: "콜롬비아 엘 트리운포 핑크버번 디카페인",
    keywords: ["FB 콜롬비아 엘 트리운포 핑크버번 디카페인"],
  },
  {
    name: "콜롬비아 파라이소 92 수단 루메",
    keywords: [
      "FB 콜롬비아 파라이소 92 수단 루메",
      "FB 콜롬비아 파라이소92 수단 루메",
    ],
  },
  {
    name: "브라질 로즈다이아",
    keywords: ["FB 브라질 로즈다이아"],
  },
  {
    name: "케냐 야라 AB TOP",
    keywords: ["FB 케냐 야라 AB TOP"],
  },
  {
    name: "에티오피아 시다모 벤사 봄베 바샤 베켈레 무산소 발효 내추럴",
    keywords: ["FB 에티오피아 시다모 벤사 봄베 바샤 베켈레 무산소 발효 내추럴"],
  },
  {
    name: "페루 카마르카 셀렉토 앤 모리토 게이샤",
    keywords: ["FB 페루 카마르카 셀렉토 앤 모리토 게이샤"],
  },
  {
    name: "코스타리카 라 에스메랄다 게이샤 콜드퍼먼테이션 내추럴",
    keywords: ["FB 코스타리카 라 에스메랄다 게이샤 콜드퍼먼테이션 내추럴"],
  },
  {
    name: "콜롬비아 몬테 블랑코 블루베리",
    keywords: ["FB 콜롬비아 몬테 블랑코 블루베리"],
  },
  {
    name: "콜롬비아 엘 디비소 옴블리곤 내추럴",
    keywords: ["FB 콜롬비아 엘 디비소 옴블리곤 내추럴"],
  },
  {
    name: "콜롬비아 마사틀란 에르난도 아실라 카투라 - 블랙베리",
    keywords: ["FB 콜롬비아 마사틀란 에르난도 아실라 카투라 - 블랙베리"],
  },
  {
    name: "콜롬비아 아나야 레드버번 체리 코디얼",
    keywords: ["FB 콜롬비아 아나야 레드버번 체리 코디얼"],
  },
];

export const singleBeanMenus = [
  {
    name: "의식의 흐름",
    keywords: ["의식의 흐름"],
  },
  {
    name: "봄 블렌드",
    keywords: ["봄 블렌드", "2026 봄 블렌드"],
  },
  {
    name: "과테말라 게이샤",
    keywords: ["과테말라 게이샤"],
  },
  {
    name: "콜롬비아 디카페인",
    keywords: [
      "콜롬비아 파라이소92 디카페인",
      "콜롬비아 파라이소92 피치 바이올렛 디카페인",
      "콜롬비아 파라이소92 피치 바이올렛 (디카페인)",
      "콜롬비아 파라이소 디카페인",
      "콜롬비아 엘 트리운포 핑크버번 디카페인",
      "콜롬비아 디카페인",
    ],
  },
  {
    name: "과테말라 핀카 메디나Q APCA",
    keywords: [
      "과테말라 핀카 메디나 Q",
      "과테말라 핀카 메디나Q",
      "과테말라 핀카 메디나Q APCA",
      "과테말라 핀카 메디나 Q APCA",
    ],
  },
  {
    name: "프루티 선라이트",
    keywords: ["프루티선라이트", "프루티 선라이트"],
  },
  {
    name: "너티브라운",
    keywords: ["너티브라운", "너티 브라운"],
  },
  {
    name: "디카페인",
    keywords: ["디카페인"],
  },
  {
    name: "예멘 모카 마타리 셀렉션 내추럴",
    keywords: [
      "예맨 모카 마타리 셀렉션 내추럴",
      "예멘 모카 마타리 셀렉션 내추럴",
    ],
  },
  {
    name: "과테말라 핀카 워시드",
    keywords: ["과테말라 핀카 워시드"],
  },
  {
    name: "에티오피아 노르딕 어프로치 구지 시코 내추럴",
    keywords: ["에티오피아 노르딕 어프로치 구지 시코 내추럴"],
  },
  {
    name: "콜롬비아 아나야 옴블리곤 써멀쇼크 워시드 로즈 스플래쉬",
    keywords: ["콜롬비아 아나야 옴블리곤 써멀쇼크 워시드 로즈 스플래쉬"],
  },
  {
    name: "에티오피아 콰미 AFCA Toh Regional 워시드 1위 와테",
    keywords: ["에티오피아 콰미 AFCA Toh Regional 워시드 1위 와테"],
  },
  {
    name: "파나마 아부 게이샤 GW-3155",
    keywords: ["파나마 아부 게이샤 GW-3155"],
  },
  {
    name: "콜롬비아 파라이소 92 수단 루메",
    keywords: ["콜롬비아 파라이소 92 수단 루메", "콜롬비아 파라이소92 수단 루메"],
  },
];

export const dessertMenus = [
  "티라미수",
  "생망고 케이크",
  "생딸기 케이크",
  "바스크 치즈 케이크",
  "생딸기 쇼콜라 컵케이크",
  "생망고 빙수 2인",
  "생망고 빙수 4인",
  "생딸기 홀케이크",
  "생망고 홀케이크",
  "그랑핸드 아이스크림",
  "초코 쉬폰 케이크",
  "시트러스 그라니따",
  "팥빙수 2인",
];

export const bakeryMenus = [
  "플레인 휘낭시에",
  "슈가코트 휘낭시에",
  "통밀 후추 잼 쿠키",
  "크루아상",
  "크리미팥 모찌",
  "소금빵",
  "공주 밤 식빵",
  "올리브 치아바타",
  "먹물 치아바타",
];
