export const beanSalesRules = {
  nutty: {
    label: "너티",
    keywords: ["원두: 너티브라운", "원두: 너티 브라운"],
  },
  fruity: {
    label: "프루티",
    keywords: ["원두: 프루티선라이트", "원두: 프루티 선라이트"],
  },
  decaf: {
    label: "디카페인",
    keywords: ["원두: 디카페인"],
  },
  dripbag: {
    label: "드립백",
    keywords: ["드립백"],
    excludeKeywords: ["드립백 파우치"],
  },
};

export const drinkMenus = [
  "아메리카노",
  "라떼",
  "바닐라 라떼",
  "카푸치노",
  "코르타도",
  "에스프레소",
  "콘파냐",
  "아포가토",
  "카페모카",
  "오늘의 커피",
  "시나몬라떼",
  "남산",
  "안국",
  "그랑핸드",
  "너티 크림라떼",
  "크림라떼",
  "콜드브루",
  "바닐라 콜드브루 라떼",
  "시청",
  "리저브 콜드브루",
  "딸기 말차 라떼",
  "딸기 라떼",
  "우지 말차 라떼",
  "레몬진저 에이드",
  "레몬 진저 티",
  "트로피컬 망고스무디",
  "차이라떼",
  "쇼콜라 밀크",
  "미숫가루 라떼",
  "마살라 차이",
  "밀크티",
  "생망고 주스",
  "스트로베리 블랙티",
  "애플 시나몬",
  "얼그레이",
  "우유",
  "잉글리쉬 브렉퍼스트",
  "캐모마일 티",
  "피치블랙티",
  "피치 파라다이스",
  "히비스커스",
  "자몽민트에이드",
  "바질 토마토 에이드",
  "페퍼민트",
  "의식의 흐름",
  "과테말라 게이샤",
  "에티오피아 내추럴",
  "과테말라 핀카 워시드",
  "브라질 로즈다이아",
  "콜롬비아 파라이소",
  "봄 블렌드",
  "아이리시 커피",
  "에스프레소 마티니",
];

export const newDrinkMenus = [
  "자몽민트에이드",
  "바질 토마토 에이드",
  "생망고 주스",
  "트로피컬 망고스무디",
  "리저브 콜드브루",
  "우지 말차 라떼",
];

export const singleOriginMenus = [
  {
    name: "봄 블렌드(2026)",
    keywords: ["FB 봄 블렌드(2026)"],
  },
  {
    name: "과테말라 게이샤",
    keywords: ["FB 과테말라 게이샤"],
  },
  {
    name: "의식의 흐름",
    keywords: ["FB 의식의흐름", "FB 의식의 흐름"],
  },
  {
    name: "과테말라 핀카 워시드",
    keywords: ["FB 과테말라 핀카 워시드"],
  },
  {
    name: "콜롬비아 파라이소92 피치 바이올렛 (디카페인)",
    keywords: ["FB 콜롬비아 파라이소92 피치 바이올렛 (디카페인)"],
  },
];

export const singleBeanMenus = [
  {
    name: "의식의 흐름",
    keywords: ["의식의 흐름"],
  },
  {
    name: "봄 블렌드",
    keywords: ["봄 블렌드", "2026 봄 블렌드"],
  },
  {
    name: "과테말라 게이샤",
    keywords: ["과테말라 게이샤"],
  },
  {
    name: "콜롬비아 디카페인",
    keywords: ["콜롬비아 파라이소92 디카페인", "콜롬비아 디카페인"],
  },
  {
    name: "과테말라 핀카 메디나 Q",
    keywords: ["과테말라 핀카 메디나 Q"],
  },
];

export const dessertMenus = [
  "티라미수",
  "생망고 케이크",
  "생딸기 케이크",
  "바스크 치즈 케이크",
  "생딸기 쇼콜라 컵케이크",
  "생망고 빙수 2인",
  "생망고 빙수 4인",
  "생딸기 홀케이크",
  "생망고 홀케이크",
  "그랑핸드 아이스크림",
  "초코 쉬폰 케이크",
  "시트러스 그라니따",
  "팥빙수 2인",
];

export const bakeryMenus = [
  "플레인 휘낭시에",
  "슈가코트 휘낭시에",
  "통밀 후추 잼 쿠키",
  "크루아상",
  "크리미팥 모찌",
  "소금빵",
  "공주 밤 식빵",
  "올리브 치아바타",
  "먹물 치아바타",
];
